base/Catalogs/бит_ОбъектыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ОбъектыСистемы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Comment>Отключено действие механизма разделения доступа на уровне базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/CommonForms/бит_ФормаВыбораОбъектовСистемы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
        
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидыОбъектов") Тогда
		ВидыОбъектов 		 = Параметры.ВидыОбъектов;
	КонецЕсли;
	Если Параметры.Свойство("ТекущийОбъектСистемы") Тогда
		ТекущийОбъектСистемы = Параметры.ТекущийОбъектСистемы;
    КонецЕсли; 
	Если Параметры.Свойство("ДоступныеОбъектыСистемы") Тогда
		ДоступныеОбъектыСистемы = Параметры.ДоступныеОбъектыСистемы;
	КонецЕсли; 
	ТолькоВключенные = Параметры.ТолькоВключенные;
	
	КэшЗначений = ОбновитьДерево();	
	Если КэшЗначений.ТекущийОбъектСистемы <> Неопределено Тогда	
		 Элементы.ОбъектыСистемы.ТекущаяСтрока = КэшЗначений.ТекущийОбъектСистемы;		 
	КонецЕсли;	   	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыСистемы

&НаКлиенте
Процедура ОбъектыСистемыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоКнопкеОК(Элементы.ОбъектыСистемы.ТекущиеДанные);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновитьДерево(Команда)
	
	КэшЗначений = ОбновитьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПоКнопкеОК(Элементы.ОбъектыСистемы.ТекущиеДанные);
	Если ЭтотОбъект.Открыта() Тогда		
		Закрыть();		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура обрабатывает нажатие на кнопку ОК.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаДереваЗначения.
// 
&НаКлиенте
Процедура ПоКнопкеОК(ТекущаяСтрока)

	Если ТекущаяСтрока = Неопределено Тогда 	
		Возврат;	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ОбъектСистемы) Тогда	
		 ОповеститьОВыборе(ТекущаяСтрока.ОбъектСистемы); 	
	КонецЕсли; 

КонецПроцедуры // ПоКнопкеОК()

// Процедура заполняет дерево "ОбъектыСистемы" по справочнику с учетом отбора.
// 
// Возвращаемое значение:
//  Струкутра.
// 
&НаСервере
Функция ОбновитьДерево()
	
	КэшЗначений = Новый Структура;	
	КэшЗначений.Вставить("ТекущийОбъектСистемы");	
	
	ДанныеДерева = ОбъектыСистемы.ПолучитьЭлементы();
	ДанныеДерева.Очистить();
	
	// Получаем объекты системы.
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	бит_ОбъектыСистемы.Ссылка КАК ОбъектСистемы,
	|   бит_ОбъектыСистемы.Наименование КАК СинонимОбъекта,
	|	бит_ОбъектыСистемы.ВидОбъекта КАК ВидОбъекта
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|ГДЕ
	|	(НЕ бит_ОбъектыСистемы.ЭтоГруппа)";
					
	Если ВидыОбъектов.Количество() > 0 Тогда		
		Запрос.УстановитьПараметр("ВидОбъекта",ВидыОбъектов);
		Запрос.Текст = Запрос.Текст +"
	                |	И бит_ОбъектыСистемы.ВидОбъекта В(&ВидОбъекта)";	
	КонецЕсли;
	
	Если ДоступныеОбъектыСистемы.Количество() > 0 Тогда	
	    Запрос.УстановитьПараметр("ДоступныеОбъектыСистемы",ДоступныеОбъектыСистемы);
		Запрос.Текст = Запрос.Текст +"
		               |И бит_ОбъектыСистемы.Ссылка В (&ДоступныеОбъектыСистемы)";	
	КонецЕсли; 
	
	Если ТолькоВключенные Тогда
		Запрос.Текст = Запрос.Текст +"
		               |И (НЕ бит_ОбъектыСистемы.ИмяОбъекта ПОДОБНО ""Удалить%"")
					   |И (НЕ бит_ОбъектыСистемы.ИмяОбъекта ПОДОБНО ""бит_Удалить%"")";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст+"					
	                |ИТОГИ ПО
	                |	ВидОбъекта,
	                |	ОбъектСистемы
					|АВТОУПОРЯДОЧИВАНИЕ";
					

	Результат = Запрос.Выполнить();
	 
	ВыборкаВид = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	 
	Пока ВыборкаВид.Следующий() Цикл
		 
		ЭлементДереваВерх = ДанныеДерева.Добавить();
		ЭлементДереваВерх.Синоним = ВыборкаВид.ВидОбъекта;
		ЭлементДереваВерх.ВидОбъекта = ВыборкаВид.ВидОбъекта;
		КартинкаВида = бит_УправлениеОбъектамиСистемы.ОпределитьКартинкуВидаОбъекта(ВыборкаВид.ВидОбъекта);
		Если КартинкаВида <> Неопределено Тогда			   
			ЭлементДереваВерх.Картинка = КартинкаВида;			   
		КонецЕсли; 
		   
		КоллекцияЭлементовВерх = ЭлементДереваВерх.ПолучитьЭлементы();
		   
		Выборка = ВыборкаВид.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		   
		Пока Выборка.Следующий() Цикл

			ОбъектСистемы = Выборка.ОбъектСистемы;			   

			ЭлементДерева = КоллекцияЭлементовВерх.Добавить();
			ЭлементДерева.Синоним       = Выборка.СинонимОбъекта;
			ЭлементДерева.ОбъектСистемы = ОбъектСистемы;
			ЭлементДерева.ВидОбъекта    = ВыборкаВид.ВидОбъекта;

			Если ОбъектСистемы = ТекущийОбъектСистемы Тогда			   
				КэшЗначений.ТекущийОбъектСистемы = ЭлементДерева.ПолучитьИдентификатор();			   
			КонецЕсли;			   

		КонецЦикла;  // По объектам системы
		   
	 КонецЦикла; // По видам объекта
	 
	 // Если указан один вид объектов для заполнения, тогда.
	 Если ВидыОбъектов.Количество() = 1 Тогда		 
		 // Раскроем все уровни дерева объектов системы.
		 Элементы.ОбъектыСистемы.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;		 
	 КонецЕсли;
	 
	  Возврат КэшЗначений;
	 
КонецФункции // ОбновитьДерево()

#КонецОбласти
